client/results/rq2/h1/stresstest/client_256/summary.txt
starting benchmark...
spawning thread #0: 128 total client(s). 25000 total requests
spawning thread #1: 128 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 14.09s, 3548.60 req/s, 15.56MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      657us       4.23s     64.89ms    158.87ms    99.44%
time for connect:    24.11ms    151.73ms     87.51ms     26.01ms    69.14%
time to 1st byte:   121.50ms       3.49s    789.52ms    785.30ms    91.02%
req/s           :      13.87       19.83       15.43        1.47    76.56%